Revit 2027 API
CurveElement.SupportsTangentLocks Property
 Indicates whether or not this curve element can have a locked tangent join at either of its end-points shared with another curve element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SupportsTangentLocks { get; }
Public ReadOnly Property SupportsTangentLocks As Boolean
	Get
public:
property bool SupportsTangentLocks {
	bool get ();
}
member SupportsTangentLocks : bool with get
Property Value
Boolean
See Also
Reference
CurveElement Class
Autodesk.Revit.DB Namespace